[
    {
      "imageSrc": "../img/camera_a_1.png",
      "productName": "EOS M50 Mark II (EF-M15-45mm f/3.5-6.3 IS STM)",
      "productDescription": "น้ำหนักเบาและมีสไตล์ด้วย EOS M50 Mark II สนุกสนานแต่ใช้งานง่ายด้วยการเชื่อมต่อ Wi-Fi เพื่อให้เหล่าคอนเทนต์ครีเอเตอร์ได้ใกล้ชิดกับผู้ชมได้ตลอดเวลา อัพเดตเรื่องราวด้วยคุณภาพสูงระดับ 4K ผ่านโซเชียลมีเดีย พร้อมการจับภาพแบบออโต้ของดวงตาและใบหน้าอย่างแม่นยำ",
      "features": [
        "- ระบบการถ่ายทอดสดบนยูทูปในตัวเครื่อง (In-camera YouTube live streaming) สำหรับการบันทึกวิดีโอแบบเรียลไทม์",
        "- บันทึกวิดีโอ 4K แบบแนวตั้งสำหรับโซเชียลมีเดีย",
        "- การเชื่อมต่อไร้สายกับสมาร์ทโฟนและแหล่งจัดเก็บบนคลาวด์"
      ],
      "price": "24,990 บาท",
      "link": "https://th.canon/th/consumer/eos-m50-mark-ii-ef-m15-45mm-f-3-5-6-3-is-stm/product?category=photography&subCategory=mirrorless-eos-m"
    },
    {
      "imageSrc": "../img/camera_a_2.png",
      "productName": "EOS 850D (EF-S18-55mm f/4-5.6 IS STM)",
      "productDescription": "กล้อง EOS 850D คือ กล้อง DSLR ซึ่งรวบรวมฟีเจอร์ต่างๆเข้าไว้เหมือนเป็นกล้องชั้นสูงที่ง่ายต่อการใช้งานและให้ผลงานคุณภาพเยี่ยมที่คุณต้องการในราคาที่จับต้องได้ สำหรับผู้ที่หลงใหลการถ่ายภาพ กล้องตัวนี้คือตัวเลือกที่สมเหตุสมผลเพื่อช่วยให้คุณก้าวข้ามไปสู่ความเป็นมืออาชีพในการถ่ายภาพ <br><br> มาพร้อมฟังค์ชั่นการใช้งานที่ล้ำสมัยเทียบกล้องระดับไฮเอนด์ แต่ยังคงใช้งานง่าย คุ้มราคาและให้ภาพที่มีคุณภาพอย่างที่คุณต้องการ Canon EOS 850D จัดเป็นกล้อง DSLR ทางเลือกที่มีความครบครัน เหมาะสำหรับการถ่ายภาพแบบจริงจัง เพื่อก้าวไปสู่อีกขั้นของการถ่ายภาพระดับโปร",
      "features": [
        "- ความละเอียด 24.1 ล้านพิกเซล มาพร้อมระบบเซนเซอร์ APS-C CMOS และการบันทึกวิดีโอระดับ 4K",
        "- จำนวนโฟกัส 45 จุด (ผ่านช่องมองภาพ) และระบบ Dual Pixel CMOS AF (ผ่าน Live View)",
        "- รองรับการเชื่อมต่อ Wi-Fi เป็นมิตรต่อผู้ใช้งาน"
      ],
      "price": "34,900 บาท",
      "link": "https://th.canon/th/consumer/eos-850d-ef-s18-55mm-f-4-5-6-is-stm/product?category=photography&subCategory=dslr-eos"
    },
    {
      "imageSrc": "../img/camera_a_3.png",
      "productName": "EOS 1500D Kit (EF S18-55 IS II)",
      "productDescription": "ผู้ใช้กล้องทุกคนไม่ว่าจะเป็นมือใหม่หรือมืออาชีพจะสามารถถ่ายภาพและวิดีโอได้อย่างสวยงามน่าทึ่งได้ด้วยกล้องดีเอสแอลอาร์รุ่นนี้ ซึ่งมีเซ็นเซอร์ภาพ CMOS APS-C ความละเอียด 24.1 ล้านพิกเซล และช่องมองภาพแบบออปติคัลเพื่อประสบการณ์การถ่ายภาพที่เป็นเอกลักษณ์ของกล้องดีเอสแอลอาร์ ถ่ายภาพได้คมชัดอย่างง่ายดายด้วยระบบออโต้โฟกัสที่รวดเร็วและแม่นยำ พร้อมบริเวณมือจับขนาดใหญ่ที่ช่วยให้สามารถถือกล้องได้ถนัดกระชับมือ นอกจากนี้ยังสามารถเชื่อมต่อ Wi-Fi และ NFC เพื่อการอัพโหลดภาพและวิดีโอไปยังโซเชียลมีเดียได้อย่างไม่สะดุด",
      "features": [
        "- เซ็นเซอร์ CMOS APS-C ความละเอียด 24.1 ล้านพิกเซล และชิปประมวลผลภาพ DIGIC 4+",
        "- ระบบออโต้โฟกัส 9 จุด พร้อมออโต้โฟกัสแบบ cross-type 1 จุดตรงกลางภาพ",
        "- ความไวแสงมาตรฐาน ISO 100 - 6400 (ขยายได้ถึง ISO 12800)",
        "- รองรับ Wi-Fi / NFC"

      ],
      "price": "19,490 บาท",
      "link": "https://th.canon/th/consumer/eos-1500d-kit-ef-s18-55-is-ii/product?category=photography&subCategory=dslr-eos"
    },
    {
      "imageSrc": "../img/camera_a_4.png",
      "productName": "EOS 3000D Kit (EF S18-55 III)",
      "productDescription": "EOS 3000D มอบประสบการณ์เฉพาะตัวในการใช้กล้องดีเอสแอลอาร์ให้กับมือใหม่ โดยมาพร้อมที่จับกระชับมือ ช่องมองภาพแบบออปติคัลที่ช่วยในการถ่ายภาพอย่างรวดเร็วและแป้นปุ่มหลักเพื่อการปรับเปลี่ยนฟังก์ชันอย่างฉับไว อีกทั้งยังมีเซ็นเซอร์ CMOS APS-C ความละเอียด 18 ล้านพิกเซล ซึ่งมีขนาดใหญ่กว่าเซ็นเซอร์กล้องสมาร์ทโฟนถึง 25 เท่า จึงสามารถตรวจจับแสงและรายละเอียดของภาพได้มากกว่า ทั้งยังช่วยในการถ่ายภาพเบลอฉากหลังได้อย่างสวยงาม ข้อมูลภาพถูกประมวลผลอย่างรวดเร็วโดยชิป DIGIC 4+ ที่ให้ภาพที่มีความละเอียดและคุณภาพสูง กล้องมีขนาดเล็กและน้ำหนักเบาเพียง 436 กรัม (รวมแบตเตอรีและการ์ดหน่วยความจำ) จึงเหมาะอย่างยิ่งสำหรับการพกพาไปในการเดินทาง",
      "features": [
        "- เซ็นเซอร์ CMOS APS-C ความละเอียด 18 ล้านพิกเซล และชิปประมวลผลภาพ DIGIC 4+",
        "- ระบบออโต้โฟกัส 9 จุด พร้อมออโต้โฟกัสแบบ cross-type 1 จุดตรงกลางภาพ",
        "- ความไวแสงมาตรฐาน ISO 100 - 6400 (ขยายได้ถึง ISO 12800)",
        "- รองรับ Wi-Fi"
      ],
      "price": "16,890 บาท",
      "link": "https://th.canon/th/consumer/eos-3000d-kit-ef-s18-55-iii/product?category=photography&subCategory=dslr-eos"
    }
]
  