[
    {
      "imageSrc": "../img/camera_b_1.png",
      "productName": "EOS 6D Mark II (Body)",
      "productDescription": "EOS 6D Mark II กล้อง DSLR แบบฟูลเฟรมในตระกูล EOS ที่มีน้ำหนักเบาที่สุด ครบครันด้วยสุดยอดฟังก์ชั่น พร้อมบอดี้ขนาดกะทะรัดน้ำหนักเบา ที่จะช่วยยกระดับภาพถ่ายของคุณไปอีกขั้น ด้วยเซ็นเซอร์ภาพความละเอียด 26.2 ล้านพิกเซล เทคโนโลยีออโต้โฟกัส Dual Pixel CMOS AF และหน้าจอแอลซีดีทัชสกรีนปรับได้หลายทิศทาง ช่วยให้ได้ภาพสวยน่าประทับใจทั้งภาพนิ่งและวิดีโอ สามารถเลือกโฟกัสอัตโนมัติได้รวดเร็วจากหน้าจอทัชสกรีน ซึ่งปรับได้หลากหลายมุม มาพร้อมระบบ Movie Digital IS ป้องกันภาพสั่นไหวแบบ 5 แกน ช่วยลดแรงสั่นของตัวกล้องเมื่อถ่ายวิดีโอแบบแฮนด์เฮลด์ เป็นฟีเจอร์หนึ่งที่มีประโยชน์มาก เมื่อต้องการบันทึกภาพคุณภาพสูงระดับ Full HD ความเร็ว 60p / 50p",
      "features": [
        "- เซ็นเซอร์ภาพ CMOS แบบฟูลเฟรม ความละเอียด 26.2 ล้านพิกเซล",
        "- เทคโนโลยี Dual Pixel CMOS AF",
        "- ระบบออโต้โฟกัสแบบ cross-type ทั้งหมด 45 จุด ถ่ายภาพต่อเนื่องสูงสุด 6.5 เฟรมต่อวินาที",
        "- ความไวแสง ISO 100 – 40000 (ขยายได้ถึง 102400)",
        "- ระบบ GPS พร้อมฟังก์ชั่นเชื่อมต่อ Wi-Fi, NFC และบลูทูธ ช่วยประหยัดแบตเตอรี่"

      ],
      "price": "54,490 บาท",
      "link": "https://th.canon/th/consumer/eos-6d-mark-ii-body/product?category=photography&subCategory=dslr-eos"
    },
    {
      "imageSrc": "../img/camera_b_2.png",
      "productName": "EOS 90D (Body)",
      "productDescription": "EOS 90D ได้รับการออกแบบมาสำหรับผู้ที่ต้องการสร้างชิ้นงานอันยอดเยี่ยมได้อย่างไม่รู้จบ มาพร้อมกับออโต้โฟกัสแบบ cross-type AF มากถึง 45 จุด เมื่อถ่ายภาพผ่านช่องมองภาพ ซึ่งครอบคลุมการมองเห็น 100% และยังสามารถโฟกัสเกาะติดวัตถุในทุกโมเม้นต์ ไม่ว่าจะเป็นการถ่ายภาพกีฬาหรือสัตว์ป่าต่าง ๆ ด้วยความสามารถในการถ่ายภาพต่อเนิ่องได้ถึง 10 ภาพต่อวินาที อีกทั้งยังมีจุดโฟกัสให้เลือกได้ถึง 5,481 ตำแหน่ง ร่วมด้วยระบบตรวจจับดวงตาอัตโนมัติ (eye detection AF) ช่วยให้อิสระแก่ผู้ใช้งานในการจัดองค์ประกอบของภาพได้แม้ถ่ายภาพในโหมด Live View โดยมั่นใจได้ว่าทุกภาพถ่ายจะมีความคมชัดอย่างแน่นอน",
      "features": [
        "- 32.5 ล้านพิกเซล เซนเซอร์ CMOS ขนาด APS-C + ระบบประมวลผลภาพ DIGIC 8",
        "- เทคโนโลยี Dual Pixel CMOS AF",
        "- 45 cross-type AF (เมื่อใช้ช่องมองภาพ)",
        "- ระบบตรวจจับใบหน้า (เมื่อใช้ช่องมองภาพ & Live View)",
        "- เลือกตำแหน่งโฟกัสได้ 5,481 ตำแหน่ง (เมื่อใช้ Live View )",
        "- ระบบโฟกัสตรวจจับดวงตาอัตโนมัติ (ภาพเดียว & โฟกัสติดตามขณะเคลื่อนไหว - เมื่อใช้ Live View )",
        "- วิดีโอ 4K (ครอป/ไม่ครอป)"
      ],
      "price": "47,990 บาท",
      "link": "https://th.canon/th/consumer/eos-90d-body-only/product?category=photography&subCategory=dslr-eos"
    },
    {
      "imageSrc": "../img/camera_b_3.png",
      "productName": "EOS-1D X Mark III (Body)",
      "productDescription": "EOS-1D series เป็นผลงานชิ้นโบว์แดงของแคนนอน ด้วยความแตกต่างอย่างโดดเด่นของกล้อง DSLR แบบฟูลเฟรมสำหรับมืออาชีพ การทำงานของกล้องที่แข็งแกร่งและเชื่อถือได้ ให้การตอบสนองที่รวดเร็ว การโฟกัสของกล้อง Canon EOS-1D X Mark III ที่ใช้งานง่าย ผลิตภาพถ่ายคุณภาพเยี่ยม รวมถึงการอัดวิดีโอแบบ 4K อันน่าทึ่งสำหรับงานที่ต้องการความท้าทายเป็นอย่างมาก",
      "features": [
        "- เซนเซอร์ CMOS 20.1MP และระบบการประมวลผลภาพ DIGIC X",
        "- เซนเซอร์ AF ความละเอียดภาพสูงถึง 191 (ผ่านช่องมองภาพแบบโฟกัสอัตโนมัติ)",
        "- ถ่ายภาพต่อเนื่องในโหมด AF/AE tracking ได้มากถึง16 ภาพต่อวินาที (ผ่านช่องมองภาพแบบออพติคอล)/20 ภาพต่อวินาที (ผ่านทางจอ LCD)",
        "- รองรับการบันทึกฟอร์แมต 10-bit HEIF (HDR PQ)",
        "- 5.5K 50p/60p cropless in-camera RAW movie shooting",
        "- Canon Log (YCbCr 4:2:2, 10-bit)",
        "- เชื่อมต่อไวไฟ/บลูธูทแบบใช้พลังงานต่ำ"
      ],
      "price": "253,090 บาท",
      "link": "https://th.canon/th/consumer/eos-1d-x-mark-iii/product?category=photography&subCategory=dslr-eos"
    },
    {
      "imageSrc": "../img/camera_b_4.png",
      "productName": "EOS 5D Mark IV (Body)",
      "productDescription": "EOS 5D Mark IV เป็นกล้องรุ่นที่ 4 ในตระกูลกล้องฟูลเฟรมที่ขายดีที่สุดของแคนนอน โดดเด่นด้วยการพัฒนาที่สมบูรณ์และความก้าวหน้าในหลายด้าน มาพร้อมเซ็นเซอร์ CMOS ฟูลเฟรม ความละเอียด 30.4 ล้านพิกเซล เทคโนโลยี Dual Pixel CMOS AF ช่วยในการถ่ายภาพได้อย่างรวดเร็วและแม่นยำสูงทั้งภาพนิ่งและวิดีโอ 4K ได้คุณภาพระดับโปร ด้วยความสามารถที่หลากหลายในการถ่ายภาพ นี่คือสุดยอดกล้องดีเอสแอลอาร์ที่เกิดมาเพื่อถ่ายทอด ไอเดียสร้างสรรค์ของช่างภาพมืออาชีพ ออกมาเป็นภาพถ่าย",
      "features": [
        "- เทคโนโลยี Dual Pixel CMOS AF",
        "- เซ็นเซอร์ CMOS ฟูลเฟรม ความละเอียด 30.4 ล้านพิกเซล",
        "- ถ่ายวิดีโอแบบ 4K (30p) พร้อมฟังก์ชั่น 4K Frame Grab",
        "- ระบบออโต้โฟกัส 61 จุด"
      ],
      "price": "108,990 บาท",
      "link": "https://th.canon/th/consumer/eos-5d-mark-iv/product?category=photography&subCategory=dslr-eos"
    }
]
  