[
    {
      "imageSrc": "../img/lens_a_1.png",
      "productName": "EF-S18-135mm f/3.5-5.6 IS USM",
      "productDescription": "เลนส์ซูมมาตรฐานขนาดกะทัดรัดและอเนกประสงค์ซึ่งใช้ Nano USM สำหรับใช้งานกับกล้อง APS-C นี้ สามารถซูมได้สูงสุดประมาณ 7.5 เท่า และครอบคลุมตัวแบบแทบทุกประเภท เลนส์ชนิดนี้ใช้การออกแบบทางออปติคอลที่คิดค้นโดย Canon ที่ช่วยป้องกันแสงหลอกและแสงแฟลร์ ทำให้ได้ภาพที่มีคุณภาพดียิ่งขึ้นกว่าเดิม Nano USM ที่เพิ่มสมรรถนะให้กับโฟกัสอัตโนมัติ ไม่เพียงทำให้โฟกัสเร็วขึ้นกว่าเลนส์รุ่นก่อนถึง 2.5 เท่า (ระยะมุมกว้าง) และ 4.3 เท่า (ระยะเทเลโฟโต้) เท่านั้น แต่โฟกัสอัตโนมัติยังทำงานเงียบเชียบและต่อเนื่อง จึงเหมาะสำหรับการถ่ายภาพต่อเนื่องอย่างแท้จริง ระบบป้องกันภาพสั่นไหว (IS) ซึ่งทำงานได้เทียบเท่ากับความเร็วชัตเตอร์ 4 สต็อป ยังมีระบบ Dynamic IS ที่ช่วยลดอาการกล้องสั่นที่เกิดจากการถ่ายภาพเคลื่อนไหวระหว่างเดิน รูรับแสงทรงกลมแบบ 7 กลีบช่วยรับประกันการสร้างวงกลมโบเก้ที่สวยสดงดงาม นอกจากนี้ เลนส์ยังสามารถใช้งานร่วมกับ POWER ZOOM ADAPTER PZ-E1 ได้ ซึ่งช่วยให้คุณซูมได้อย่างต่อเนื่องมากยิ่งขึ้น",
      "features": [
        "- ทางยาวโฟกัสและรูรับแสงกว้างสุด: 18-135 มม. 1:3.5-5.6",
        "- โครงสร้างเลนส์: 16 ชิ้นเลนส์ใน 12 กลุ่ม มุมรับภาพแนวทแยง: 74°20’ - 11°30’",
        "- การปรับโฟกัส: nano-USM, ระบบโฟกัสภายใน, โฟกัสแมนนวลแบบ Full-time",
        "- ระยะโฟกัสใกล้ที่สุด: 0.39 เมตร/ 1.3 ฟุต, กำลังขยาย 0.28 เท่า",
        "- ขนาดฟิลเตอร์: ขนาดเส้นผ่าศูนย์กลาง x ความยาวสูงสุด 67 มม., น้ำหนัก: ø 77.4 x 96 มม., 515 กรัม/ 3.1” x 3.8”, 1.14 ปอนด์",
        "- เฉพาะสำหรับกล้อง APS-C, ติดตั้งระบบ IS"
      ],
      "price": "22,400 บาท",
      "link": "https://th.canon/th/consumer/ef-s18-135mm-f-3-5-5-6-is-usm/product?category=photography&subCategory=ef-lenses"
    },
    {
      "imageSrc": "../img/lens_a_2.png",
      "productName": "EF50mm f/1.8 STM",
      "productDescription": "รุ่นที่สามในเลนส์มาตรฐานตระกูล EF50mm f/1.8 ที่มียอดขายสูงสุดทั่วโลก EF50mm f/1.8 STM ซึ่งตัวเม้าท์ของเลนส์เป็นโลหะ มาพร้อมกับเทคโนโลยีมอเตอร์ STM ที่ช่วยให้การโฟกัสรวดเร็วและเงียบกว่าเดิม โครงสร้างเลนส์ประกอบด้วย 6 ชิ้นเลนส์ใน 5 กลุ่มและกลีบรูรับแสง 7 กลีบ ได้เพิ่มประสิทธิภาพด้วยการเคลือบผิวหน้าเลนส์พิเศษยับยั้งการเกิดแฟลร์และเงาซ้อนบนภาพ ทำให้ภาพมีคุณภาพสูง ด้วยการออกแบบที่มีขนาดกะทัดรัดน้ำหนักเบาซึ่งตรงกันข้ามกับเส้นผ่าศูนย์กลางเลนส์ที่มีขนาดใหญ่ เลนส์นี้สะดวกและใช้งานง่ายสำหรับทุกๆ ซีน และสามารถใช้ถ่ายรูปฉากหลังเบลอขนาดใหญ่และสวยงามได้อย่างง่ายดาย",
      "features": [
        "- ทางยาวโฟกัสและรูรับแสงกว้างสุด: 50 มม. 1:1.8",
        "- โครงสร้างเลนส์: 6 ชิ้นเลนส์ใน 5 กลุ่ม",
        "- มุมรับภาพแนวทแยง: 46"
      ],
      "price": "5,000 บาท",
      "link": "https://th.canon/th/consumer/ef50mm-f1-8-stm/product?category=photography&subCategory=ef-lenses"
    },
    {
      "imageSrc": "../img/lens_a_3.png",
      "productName": "EF70-300mm f/4-5.6 IS II USM",
      "productDescription": "เลนส์ที่สืบต่อจากเลนส์ยอดนิยมมาจากเลนส์ซูมเทเลโฟโต้อเนกประสงค์ EF70-300mm f/4-5.6 IS USM ที่รวมเทคโนโลยี Nano USM เพื่อการออโต้โฟกัสที่แม่นยำ ฉับไวและไร้เสียง ระยะโฟกัสที่ลดลงจาก 1.5 ม. เป็น 1.2 ม. ทำให้ผู้ใช้งานปรับใช้ให้เข้ากับสภาพแวดล้อมได้ง่ายขึ้น ประสิทธิภาพการออโต้โฟกัสเทียบเท่ากับชัตเตอร์ประมาณ 4 สต็อป ซึ่งสูงจากรุ่นก่อนที่อยู่ที่ 2.5 สต็อป ทำให้เลนส์ EF70-300mm f/4-5.6 IS II USM ถ่ายภาพได้คมชัดในระยะทางยาวโฟกัสที่ยาวกว่า นอกจากนี้ การแสดงข้อมูลเลนส์ด้วยปุ่มเปลี่ยนโหมดในระหว่างการแสดงช่วยให้ผู้ใช้งานทราบว่าต้องถ่ายภาพให้ได้คุณภาพขึ้นมากน้อยเพียงใด",
      "features": [
        "- ขนาดฟิลเตอร์: 67 มม.",
        "- ค่ารูรับแสงกว้างสุด: f/4 - 5.6",
        "- พร้อมมอเตอร์ Nano USM และระบบป้องกันภาพสั่นไหว"
      ],
      "price": "24,900 บาท",
      "link": "https://th.canon/th/consumer/ef70-300mm-f-4-5-6-is-ii-usm/product?category=photography&subCategory=ef-lenses"
    },
    {
      "imageSrc": "../img/lens_a_4.png",
      "productName": "EF-S10-18mm f/4.5-5.6 IS STM",
      "productDescription": "ด้วยขนาดกะทัดรัดและน้ำหนักเบาของเลนส์ซูม EF-S อัลตร้าไวด์ เป็นเลนส์ที่เหมาะสมอย่างยิ่งสำหรับการเดินทางที่ให้คุณได้ถ่ายภาพทิวทัศน์อันน่าตื่นตาตื่นใจและภาพสถาปัตยกรรมอันน่าทึ่ง การถ่ายภาพเคลื่อนไหวที่ให้ความเพลิดเพลินมากขึ้น อันเป็นผลมาจากมอเตอร์ STM ที่ลื่นไหล ระบบโฟกัสอัตโนมัติที่เงียบมาก และระบบ IS 4 สต็อป ด้วยความสามารถในการโฟกัสที่ระยะใกล้ถึง 0.22 เมตร ที่น่าประทับใจ คุณจึงสามารถถ่ายภาพโคลสอัพของวัตถุของคุณได้อย่างมีประสิทธิภาพ",
      "features": [
        "- ทางยาวโฟกัสและรูรับแสงกว้างสุด: 10-18 มม. 1:4.5-5.6",
        "- โครงสร้างเลนส์:14 ชิ้นเลนส์ใน 11 กลุ่ม มุมรับภาพแนวทแยง: 107°30′ - 74°20′",
        "- การปรับโฟกัส: ระบบโฟกัสด้านหลัง"
      ],
      "price": "12,000 บาท",
      "link": "https://th.canon/th/consumer/ef-s10-18mm-f4-5-56-is-stm-s1/product?category=photography&subCategory=ef-lenses"
    }
]