[
    {
      "imageSrc": "../img/lens_b_1.png",
      "productName": "EF70-200mm f/4L IS II USM",
      "productDescription": "เลนส์ f/4 L-series เป็นเลนส์ซูมเทเลโฟโต้รุ่นปรับปรุงใหม่ของแคนนอนที่ให้รูรับแสงคงที่ ถือเป็นรุ่นที่ได้รับความนิยมสูงจากผู้ใช้เนื่องจากความประทับใจที่ตัวเลนส์มีน้ำหนักเบาและขนาดกะทัดรัดจับถนัดมือ นอกจากนี้ยังมีการเสริมด้วยระบบออปติคัลที่ได้รับการปรับแต่งอย่างดีที่สุดเพื่อคุณภาพของภาพที่ดีขึ้น ให้ระยะโฟกัสต่ำสุดที่สั้นลง (1 ม.) และระบบป้องกันภาพสั่นไหวที่ยอดเยี่ยมยิ่งขึ้น (สูงสุดประมาณ 5 สต็อป) พร้อมกับยังสามารถป้องกันฝุ่นและละอองน้ำได้ รวมถึงการเคลือบฟลูออรีนบนพื้นผิวเลนส์ชิ้นแรกและชิ้นสุดท้ายเพื่อให้ง่ายต่อการบำรุงรักษา",
      "features": [
        "- ขนาดฟิลเตอร์ : 72 มม.",
        "- รูรับแสงกว้างสุด : f/4",
        "- ทรงพลังด้วยมอเตอร์อัลตร้าโซนิคแบบวงแหวน (USM) และระบบ IS ป้องกันภาพสั่นไหว (สูงสุดประมาณ 5 สต็อป)"
      ],
      "price": "65,400 บาท",
      "link": "https://th.canon/th/consumer/ef70-200mm-f-4l-is-ii-usm/product?category=photography&subCategory=ef-lenses"
    },
    {
      "imageSrc": "../img/lens_b_2.png",
      "productName": "EF24-70mm f/2.8L II USM",
      "productDescription": "เลนส์ EF24-70mm f/2.8L II USM ถือเป็นเลนส์ซูมมาตรฐานขนาดรูรับแสงขนาดใหญ่ประสิทธิภาพสูงและมีระยะความยาวโฟกัสกว้าง การใช้ชิ้นเลนส์แอสเฟอริคัลสามชิ้นคือ ชิ้นเลนส์ Super UD หนึ่งชิ้น และชิ้นเลนส์ UD สองชิ้น ช่วยแก้ปัญหาความคลาดของสีจากการขยายภาพที่มุมกว้างทำให้ได้ภาพที่มีคุณภาพสูง ความยาวที่ลดลงทำให้ง่ายต่อการใช้งานกับการออโต้โฟกัสที่รวดเร็วแต่ไร้เสียง การโฟกัสแบบแมนนวลตลอดเวลาและรูรับแสงทรงกลมซึ่งให้ภาพนุ่มนวลสวยงาม ด้วยระยะห่างทางยาวโฟกัสต่ำสุดที่ 0.38 ม.และกำลังขยายที่ 0.29 เท่า จึงเหมาะสำหรับการถ่ายภาพแบบโคลสอัพ",
      "features": [
        "- พร้อมมอเตอร์อัลตร้าโซนิค (USM) ชนิด ring-type",
        "- ขนาดฟิลเตอร์: 82 ม.ม.",
        "- ขนาดรูรับแสงกว้างสุด: f/2.8"
      ],
      "price": "80,900 บาท",
      "link": "https://th.canon/th/consumer/ef24-70mm-f28l-ii-usm/product?category=photography&subCategory=ef-lenses"
    },
    {
      "imageSrc": "../img/lens_b_4.png",
      "productName": "EF600mm f/4L IS III USM",
      "productDescription": "เลนส์ EF600mm f/4L IS III USM เป็นเลนส์ไพรม์เทเลโฟโต้ที่ช่างภาพมืออาชีพใช้สำหรับถ่ายภาพสัตว์ป่า กีฬามอเตอร์สปอร์ตหรือสำหรับช่างภาพข่าว ด้วยน้ำหนักที่เบาลงกว่ารุ่นก่อนหน้า 870 ก. เลนส์ตัวนี้มาพร้อมการเคลือบแบบ ASC (Air Sphere Coating) เพื่อลดแสงแฟลร์และแสงหลอกซึ่งช่วยเพิ่มความนิ่งให้ภาพ (ประมาณ 5 สต็อป) และการลดระยะโฟกัสใกล้สุดที่ 30 ซม. ช่วยให้คุณเข้าถึงวัตถุได้ใกล้ยิ่งขึ้น นอกเหนือจากโครงสร้างกันฝุ่นและหยดน้ำและการเคลือบด้วยฟลูออไรด์แล้ว ตัวเลนส์ยังมีการเคลือบกันความร้อนอีกด้วย",
      "features": [
        "- ขนาดฟิลเตอร์: 52 มม. drop-in",
        "- ค่ารูรับแสงกว้างสุด: f/4",
        "- พร้อมมอเตอร์อัลตร้าโซนิค (USM) ชนิดวงแหวน และระบบป้องกันภาพสั่นไหว"
      ],
      "price": "558,200 บาท",
      "link": "https://th.canon/th/consumer/ef600mm-f-4l-is-iii-usm/product?category=photography&subCategory=ef-lenses"
    },
    {
      "imageSrc": "../img/lens_b_3.png",
      "productName": "EF85mm f/1.4L IS USM",
      "productDescription": "เลนส์ทางยาวโฟกัส 85 มม.เป็นเลนส์ประจำสำหรับช่างภาพถ่ายภาพบุคคลและเลนส์ไพรม์ระยะ 85 มม. จากตระกูล L-series ของแคนนอน พร้อมมีระบบป้องกันภาพสั่นไหวสูงถึง 4 สต็อป มีขนาดรูรับแสง f/1.4 การออโต้โฟกัสความเร็วสูงและเทคโนโลยีด้านแอพติคัลขั้นสูงไว้ในตัวเลนส์ที่กะทัดรัดและน้ำหนักเบา เหมาะสำหรับการถ่ายภาพบุคคลด้วยการถือกล้องโดยไม่ให้มีการสั่นไหวที่ให้ผลงานคุณภาพสูง โครงสร้างตัวเลนส์ประกอบด้วยชิ้นเลนส์แอสเฟอริคัล 1 ชิ้นเพื่อแก้ปัญหาเรื่องความคลาดทรงกลมและความโค้งของพื้นที่ เพื่อให้ได้ภาพที่ชัดเจนรวมทั้งภาพรอบเส้นรอบวง และการเคลือบด้วยเทคนิค ASC (Air Sphere Coating) เพื่อป้องกันแสงหลอกและแสงแสงแฟลร์ โดยให้ผลงานภาพถ่ายคุณภาพสูง สวยงามในทุกฉาก เลนส์มีการเคลือบกันหยดน้ำและฝุ่นที่ทนทานต่อสภาพแวดล้อมที่รุนแรงและการใช้งานหนักหน่วง",
      "features": [
        "- ขนาดฟิลเตอร์: 77มม.",
        "- พร้อมมอเตอร์อัลตร้าโซนิค (USM) ชนิดวงแหวน และและและระบบป้องกันภาพสั่นไหว",
        "- ค่ารูรับแสงกว้างสุด: f/1.4"
      ],
      "price": "70,300 บาท",
      "link": "https://th.canon/th/consumer/ef85mm-f-1-4l-is-usm/product?category=photography&subCategory=ef-lenses"
    }
]