<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.1.0/css/all.css"
        integrity="sha384-lKuwvrZot6UHsBSfcMvOkWwlCMgc0TaWr+30HWe3a4ltaBwTZhyTEggF5tJv8tbt" crossorigin="anonymous">
    <link href="https://fonts.googleapis.com/css?family=Roboto|Roboto+Condensed|Roboto+Slab" rel="stylesheet">
    <link rel="stylesheet" href="../style/style.css">
    <link rel="icon" type="image/png" href="../img/Logos.png"/>
    <title>Camera city</title>
</head>

<body>

    <?php include '../component/navbar.php'; ?>

    <main>

        <h2 class="page-heading">การดูแลรักษา</h2>

        <!--  เริ่มใส่เนื้อหาตั้งแต่บรรทัดนี้  -->
        <div class="wrapper">
            <div class="row">
                <div class="heading">การดูแลรักษาและทำความสะอาดกล้อง</div>
            </div>
        </div>
        <div class="maintenance-detail">
            <h3>1. ตัวกล้อง</h3>
            ให้ใช้ลูกยางเป่าลมขจัดสิ่งสกปรกและฝุ่นละออง แล้วใช้ผ้าแห้งเนื้อนุ่มเช็ดเบาๆ
            หลังจากใช้กล้องตามชายหาดหรือริมทะเลแล้ว
            ให้ใช้ผ้าเนื้อนุ่มชุบน้ำสะอาดพอหมาดเช็ดผงทรายหรือคราบเกลือออกเบาๆ แล้วปล่อยให้แห้งสนิท ข้อสำคัญ:
            ฝุ่นผงหรือสิ่งแปลกปลอมอื่นๆ
            ที่หลุดเข้าไปภายในตัวกล้อง อาจทำให้กล้องชำรุดเสียหายโดยไม่ถือว่าอยู่ในเงื่อนไขการรับประกัน
            <br>
            <div class="main-image">
                <img class="image" src="../img/maintenance_01.jpg">
                <img class="image" src="../img/maintenance_02.jpg">

            </div>
            <br>
            <h3>2. อย่าทําตกหล่น</h3>
            การกระทบกระแทกหรือสั่นสะเทือนรุนแรงอาจทำให้ผลิตภัณฑ์ทำงานผิดปกติได้
            <br>
            <div class="main-image">
                <img class="image" src="../img/maintenance_03.jpg">
                <img class="image" src="../img/maintenance_04.jpg">

            </div>
            <br>
            <h3>3. เก็บไว้ให้ห่างจากสนามแม่เหล็กแรงสูง</h3>
            อย่าใช้หรือจัดเก็บกล้องไว้ใกล้กับอุปกรณ์ที่ให้กำเนิดรังสีคลื่นแม่เหล็กไฟฟ้าหรือสนามแม่เหล็กแรงสูง
            นอกจากนี้ ไฟฟ้าสถิตหรือสนามแม่เหล็กที่กำเนิดจากอุปกรณ์เครื่องมือ เช่น เครื่องส่งสัญญาณวิทยุ
            สามารถรบกวนการทำงานของจอภาพ
            ทำลายข้อมูลในการ์ดหน่วยความจำ หรือมีผลกระทบต่อวงจรไฟฟ้าภายในตัวผลิตภัณฑ์
            <br>
            <br>
            <h3>4. ปิดการทำงานของกล้องก่อนถอดหรือตัดการเชื่อมต่อแหล่งพลังงาน</h3>
            อย่าถอดปลั๊กผลิตภัณฑ์หรือถอดแบตเตอรี่ออกขณะกล้องเปิดอยู่
            หรือขณะกำลังบันทึกหรือลบภาพอยู่
            การฝืนตัดการจ่ายไฟออกในกรณีเหล่านี้อาจทำให้ข้อมูลสูญหายหรือทำให้หน่วยความจำหรือวงจรภายในของผลิตภัณฑ์ชำรุดเสียหายได้
            เพื่อป้องกันไม่ให้การจ่ายไฟถูกรบกวนโดยไม่ตั้งใจ
            โปรดหลีกเลี่ยงการเคลื่อนย้ายผลิตภัณฑ์ไปมาในระหว่างเชื่อมต่ออะแดปเตอร์ AC
            <br>
            <br>
            <h3>5. การทำความสะอาด</h3>
            ขณะทำความสะอาดตัวกล้อง ให้ใช้ลูกยางเป่าลมขจัดสิ่งสกปรกและฝุ่นละออง แล้วใช้ผ้าแห้งเนื้อนุ่มเช็ดเบาๆ
            หลังจากใช้กล้องตามชายหาดหรือริมทะเลแล้ว
            ให้ใช้ผ้าเนื้อนุ่มชุบน้ำสะอาดพอหมาดเช็ดผงทรายหรือคราบเกลือออกเบาๆ แล้วปล่อยให้กล้องแห้งสนิท
            ในบางกรณีซึ่งเกิดขึ้นได้น้อยมาก
            ไฟฟ้าสถิตอาจทำให้จอ LCD สว่างขึ้นหรือดับลง ทั้งนี้ไม่ได้เกิดจากการทำงานที่ผิดปกติแต่อย่างใด
            และหน้าจอจะกลับมาทำงานตามปกติอีกครั้ง
            <br>
            <br>
            <h3>6. การเก็บรักษา</h3>
            เก็บกล้องไว้ในที่แห้งและมีอากาศถ่ายเท เพื่อป้องกันการเกิดเชื้อรา ถ้าท่านใช้อะแดปเตอร์ AC อยู่
            ให้ถอดอะแดปเตอร์เพื่อป้องกันไฟลุกไหม้
            ถ้าไม่ใช้ผลิตภัณฑ์เป็นเวลานาน
            ให้ถอดแบตเตอรี่ออกเพื่อป้องกันสารเคมีรั่วไหลและเก็บกล้องไว้ในถุงพลาสติกที่มีสารดูดซับความชื้น
            อย่างไรก็ตาม
            ห้ามเก็บกระเป๋ากล้องไว้ในถุงพลาสติกเนื่องจากอาจทำให้วัสดุเสื่อมสภาพ
            โปรดทราบว่าสารดูดความชื้นจะมีประสิทธิภาพในการดูดซับความชื้นลดลงเรื่อยๆ
            จึงควรเปลี่ยนใหม่เป็นระยะๆ
            <br>
            <div class="main-image">
                <img class="image" src="../img/maintenance_06.jpg">
                <img class="image" src="../img/maintenance_05.jpg">

            </div>
            <br>
        </div>

        <div class="wrapper">
            <div class="row">
                <div class="heading">การดูแลรักษาและวิธีทำความสะอาดเลนส์</div>
            </div>
        </div>
        <div class="maintenance-detail">
            <p>
            <h3>1. ทำความสะอาดเลนส์ให้มากขึ้น­</h3>
            ก่อนที่จะเก็บเลนส์กล้องให้เข้าที่นั้น ขั้นแรกจะต้องมีการทำความสะอาดเลนส์กล้องให้เรียบร้อยก่อน
            โดยเริ่มจากการถอดเลนส์กล้องออกมาจากตัวกล้อง
            แล้วใช้ลูกยางเป่าลมและแปรงปัดทำความสะอาดในส่วนของฝุ่นหน้าเลนส์ออก
            หากยังคงมีฝุ่นอยู่ให้ทำการใช้ผ้าไมโครไฟเบอร์เช็ดไปที่หน้าเลนส์แบบเบามือ
            โดยเช็ดแบบวนไปในทิศทางเดียวกัน
            และถ้าหน้าเลนส์มีคราบมันติดอยู่ก็สามารถใช้น้ำยาเช็ดเลนส์ฉีดลงไปที่หน้าเลนส์ 1
            ครั้ง แล้วใช้ผ้าไมโครไฟเบอร์เช็ด
            หรือจะฉีดน้ำยาเช็ดเลนส์ลงไปที่เลนส์ทิชชู่ก่อนแล้วค่อยนำไปเช็ดเลนส์ก็ได้
            นอกจากนี้ยังสามารถถอดฟิลเตอร์หน้าเลนส์ออกมาทำความสะอาดได้เช่นกัน
            <br>
            <div class="main-image">
                <img class="image" src="../img/maintenance_07.jpg">
                <img class="image" src="../img/maintenance_08.jpg">

            </div>
            <br>
            <h3>2. เก็บเลนส์ไว้ในภาชนะที่มีสารดูดความชื้น</h3>
            บางครั้งการเอากล้องใส่ไว้ในกระเป๋า ก็สะดวกต่อการใช้งาน เเต่ทุกครั้งที่กล้องถูกนำออกมาใช้งานนั้น
            กล้องและเลนส์จะสัมผัสกับความชื้นในอากาศ
            และความชื้นจากเหงื่อของตัวผู้ใช้เอง ดังนั้นความชื้นจะเป็นตัวชักนำให้เกิดเชื้อราขึ้น
            ดังนั้นหลังการทำความสะอาดควรจะมีการถอดเก็บไว้
            และบรรจุในภาชนะที่มีสารดูดความชื้นอยู่
            <br>
            <div class="main-image">
                <img class="image" src="../img/maintenance_10.jfif">
                <img class="image" src="../img/maintenance_09.jpg">

            </div>
            <br>
            <h3>3. เก็บเลนส์ไว้ในตู้กันชื้น</h3>
            กล่องพลาสติกที่มีฝาปิดแน่น และป้องกันความชื้นได้ดี ใส่ซิลิกาเจลลงไป เก็บกล้องได้
            ถ้ามีงบเยอะอาจจะหากล่องเก็บกล้องและเลนส์เฉพาะเลยก็ได้
            เช่3นตู้ dehumidifier dry cabinet จะเป็นตู้กระจกเก็บอุปกรณ์ ทำหน้าที่ช่วยดูดความชื้นในตู้
            และป้องกันการเกิดเชื้อรา
            แต่ถ้างบน้อยกล่องอาหารแล้วใส่สารดูดความชื้นก็เป็นตัวเลือกที่ดี
            <br>
            <br>
            <h3>4. เก็บไว้ในห้องที่มีอากาศถ่ายเท</h3>
            อากาศถ่ายเทจะช่วยให้ความชื้นน้อย และไม่ก่อให้เกิดการฟอร์มตัวของเชื้อรา ถ้าหากมีห้องที่มีเครื่องปรับอากาศ
            ก็ควรจะเก็บกล้องไว้ในห้องนั้น
            เพราะนอกจะเครื่องปรับอากาศจะปรับอุณหภูมิให้เย็นแล้ว ยังช่วยลดวามชื้นในบรรยากาศอีกด้วย
            <br>
            <br>
            </p>
        </div>

    </main>

    <?php include '../component/footer.php'; ?>
    <script>
        function setTheme(theme) {
            document.body.classList.toggle("dark-theme", theme === "dark");
            if (theme === "dark") {
                icon.src = "../img/sun.png";
            } else {
                icon.src = "../img/moon.png";
            }
        }

        function toggleTheme() {
            var currentTheme = document.body.classList.contains("dark-theme") ? "dark" : "light";
            var newTheme = currentTheme === "dark" ? "light" : "dark";

            setTheme(newTheme);

            localStorage.setItem("theme", newTheme);
        }

        var icon = document.getElementById("icon");

        document.addEventListener("DOMContentLoaded", function () {
            var savedTheme = localStorage.getItem("theme");

            if (savedTheme) {
                setTheme(savedTheme);
            }

            icon.onclick = toggleTheme;
        });
    </script>
</body>

</html>